Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This form is to view the changes you have in your working tree relative to the named <commit>.
zh_cn: 该形式是查看您在工作树中的改变相对于指定的 <commit> 所做的更改。

source: This form is to view the changes you made relative to the index (staging area for the next commit).
zh_cn: 该形式是查看您对索引(下一次提交的暂存区)所做的更改。

source: This form is to view the changes you staged for the next commit relative to the named <commit>.
zh_cn: 该形式用于查看暂存的用于下一次提交的相对于指定的 <commit> 的更改。

source: This form is to view the differences between the raw contents of two blob objects.
zh_cn: 此表单是查看两个 blob 对象的原始内容之间的差异。

source: This form resets the current branch head to <commit> and possibly updates the index (resetting it to the tree of <commit>) and the working tree depending on <mode>.
zh_cn: 该形式将当前分支头重置到 <commit>，并根据 <mode> 可能更新索引(将其重置为 <commit> 树)和工作树。

source: This form resets the index entries for all <paths> to their state at <tree-ish>.
zh_cn: 该形式将所有 <paths> 的索引条目重置为其 <tree-ish> 的状态。

source: This form should not be combined with other pathspec.
zh_cn: 此形式不应与其他路径组合。

source: This gives the user a chance to review the difference before adding modified contents to the index.
zh_cn: 这样可以让用户在将修改后的内容添加到索引之前查看差异。

source: This has a very similar UI to update and revert, and lets you add untracked paths to the index.
zh_cn: 这与 update 和 revert 具有非常相似的界面，并允许您将未追溯路径添加到索引。

source: This has a very similar UI to update, and the staged information for selected paths are reverted to that of the HEAD version.
zh_cn: 这与 update 具有非常相似的界面，所选路径的暂存信息将恢复为 HEAD 版本。

source: This has no effect when a message is given by other means, e.g. with the -m or -F options.
zh_cn: 当通过其他方式给出消息时，这不起作用。如使用 -m 或 -F 选项。

source: This has the exact same effect as git reset --hard <upstream> (or <newbase>).
zh_cn: 这具有与 git reset --hard <upstream> (或<newbase>)完全相同的效果。

source: This implies --bare.
zh_cn: 这意味着 --bare 。

source: This information may be used by scripts or other git commands, such as git-pull[1].
zh_cn: 该信息可以由脚本或其他 git 命令使用，例如 git-pull[1] 。

source: This is a potentially dangerous mode of operation.
zh_cn: 这是潜在的 危险 操作模式。

source: This is a shorthand for "--pretty=oneline --abbrev-commit" used together.
zh_cn: 这是一起使用的 "--pretty=oneline --abbrev-commit" 的缩写。

source: This is designed to be as compact as possible.
zh_cn: 这被设计为尽可能紧凑。

source: This is equivalent to running "git branch" with "-f"; see git-branch[1] for details.
zh_cn: 这相当于运行“git branch”与“-f”;详见 git-branch[1] 。

source: This is equivalent to setting the GIT_GLOB_PATHSPECS environment variable to 1.
zh_cn: 这相当于将 GIT_GLOB_PATHSPECS 环境变量设置为 1 。

source: This is equivalent to setting the GIT_ICASE_PATHSPECS environment variable to 1.
zh_cn: 这相当于将 GIT_ICASE_PATHSPECS 环境变量设置为 1 。

source: This is equivalent to setting the GIT_LITERAL_PATHSPECS environment variable to 1.
zh_cn: 这相当于将 GIT_LITERAL_PATHSPECS 环境变量设置为 1 。

source: This is equivalent to setting the GIT_NOGLOB_PATHSPECS environment variable to 1.
zh_cn: 这相当于将 GIT_NOGLOB_PATHSPECS 环境变量设置为 1 。

source: This is intended to be useful for scripts.
zh_cn: 这是为脚本有用的。

source: This is similar to doing curl --trace-ascii on the command line.
zh_cn: 这类似于在命令行上执行 curl --trace-ascii 。

source: This is synonymous to the previous form.
zh_cn: 这是上一个形式的同义词。

source: This is the default action.
zh_cn: 这是默认动作。

source: This is the default behavior.
zh_cn: 这是默认行为。

source: This is the default mode of operation of git commit if any paths are given on the command line, in which case this option can be omitted.
zh_cn: 如果在命令行中给出了任何路径，这是 git commit 的默认操作模式，在这种情况下可以省略此选项。

source: This is the default.
zh_cn: 这是默认的。

source: This is the most basic form of the command.
zh_cn: 这是命令的最基本形式。

source: This is the same as providing ^$ as the value_regex in --replace-all.
zh_cn: 这与在 --replace-all 中提供 ^$ 作为 value_regex 相同。

source: This is the same set of commits that would be shown by git log <upstream>..HEAD; or by git log 'fork_point'..HEAD, if --fork-point is active (see the description on --fork-point below); or by git log HEAD, if the --root option is specified.
zh_cn: 这组提交由 git log <upstream>..HEAD 显示的相同;或者由 git log 'fork_point' ..HEAD ，如果激活 --fork-point(请参阅下面的 --fork-point);或者由 git log HEAD ，如果指定了 --root 选项。

source: This is the transactional equivalent of
zh_cn: 这是等价的事务

source: This is to emulate git fetch run on the mothership using git push that is run in the opposite direction in order to integrate the work done on satellite, and is often necessary when you can only make connection in one way (i.e. satellite can ssh into mothership but mothership cannot initiate connection to satellite because the latter is behind a firewall or does not run sshd).
zh_cn: 这是模仿 mothership 上运行的 git fetch ，在相反的方向使用 git push 以整合 satellite 上的工作，通常在你只能完成单向连接时是必须的。(即 satellite 可以 ssh 到 mothership ，但 mothership 无法启动连接到 satellite ，因为后者的防火墙或未运行 sshd).

source: This is to view the changes between two arbitrary <commit>.
zh_cn: 这是查看两个任意的<commit>之间的变化。

source: This is typically not used directly by end users — instead, see git-gc[1].
zh_cn: 这通常不会被最终用户直接使用 - 而是参见 git-gc[1] 。

source: This is used by git cvsimport to update the index without modifying files in the work tree.
zh_cn: 这由 git cvsimport 用于更新索引，而不修改工作树中的文件。

source: This is useful for, among other things, showing the unstaged content of such files with git diff and committing them with git commit -a.
zh_cn: 这对于使用 git diff 显示这些文件的未分页内容以及使用 git commit -a 提交它们非常有用。

source: This is useful if F and G were flawed in some way, or should not be part of topicA.
zh_cn: 如果 F 和 G 以某种方式有缺陷，或者不应该是 topicA 的一部分，这是有用的。

source: This is useful to restrict recursive submodule initialization from an untrusted repository or for programs which feed potentially-untrusted URLS to git commands.
zh_cn: 这对从不受信任的仓库或将可能不受信任的 URLS 提供给 git 命令的程序来限制递归子模块初始化是有用的。

source: This is useful when topicB does not depend on topicA.
zh_cn: 当 topicB 不依赖于 topicA 时，这是有用的。

source: This is usually not what you want unless you are concluding a conflicted merge.
zh_cn: 这通常不是你想要的，除非你正结束冲突的合并。

source: This leaves a copy of next temporarily in FETCH_HEAD, but does not update any remote-tracking branches.
zh_cn: 这将在 FETCH_HEAD 中临时留下 next 的副本，但不会更新任何远程跟踪分支。

source: This leaves all your changed files "Changes to be committed", as git status would put it.
zh_cn: 这将保留所有更改后的文件为"要进行的更改"，如 git status 所示。

source: This lets you choose one path out of a status like selection.
zh_cn: 这允许您从一个 status 中像选择一样选择一个补丁。

source: This lets you quit without do cleaning.
zh_cn: 在没有做清洁的情况下退出。

source: This lets you review what will be committed (i.e. between HEAD and index).
zh_cn: 这可以让您查看将要提交的内容(即 HEAD 和索引之间)。

source: This line begins with "Merge: " and the sha1s of ancestral commits are printed, separated by spaces.
zh_cn: 该行以"Merge："开始，以空格分隔显示祖先提交的 sha1s 。

source: This makes a commit that records the modification to Makefile.
zh_cn: 这做一个提交记录 Makefile 的修改。

source: This makes sense only when following a strict policy of merging all topic branches when staying on a single integration branch.
zh_cn: 只有当遵守在一个整合分支上合并所有主题分支的严格策略时，这才有意义。

source: This manual is designed to be readable by someone with basic UNIX command-line skills, but no previous knowledge of Git.
zh_cn: 本手册的目的是让具有基本 UNIX 命令行技能，但没有的 Git 知识的人员可读。

source: This manual page describes only the most frequently used options.
zh_cn: 本手册页仅介绍最常用的选项。

source: This may be desirable if you are trying to make a back-up of your repository.
zh_cn: 如果您想要备份存储库，这可能是可取的。

source: This may be either an absolute URL ready to be passed to git-clone[1] or (if it begins with ./ or ../) a location relative to the superproject’s origin repository.
zh_cn: 这可能是一个绝对的 URL，可以传递给 git-clone[1] 或(如果以./或../开头)相对于超项目的原始存储库的位置。

source: This may be helpful for troubleshooting some pack-related performance problems.
zh_cn: 这可能有助于排除某些与包相关的性能问题。

source: This may be useful to rebuild everything from scratch, but keep manually created files.
zh_cn: 这可能用于从头开始重建，但保留手动创建的文件。

source: This means that git reset -p is the opposite of git add -p, i.e. you can use it to selectively reset hunks.
zh_cn: 这意味着 git reset -p 与 git add -p 相反，即可以使用它来选择性地重置 hunks。

source: This means that git reset <paths> is the opposite of git add <paths>.
zh_cn: 这意味着 git reset <paths> 与 git add <paths> 相反。

source: This means that you can use git checkout -p to selectively discard edits from your current working tree.
zh_cn: 这意味着您可以使用 git checkout -p 选择性地丢弃当前工作树中的编辑。

source: This mechanism can be used by projects that want to guide participants with some hints on what to write in the message in what order.
zh_cn: 这个机制可以被那些想要引导参与者的项目用于以什么顺序在消息中写什么的一些提示。

source: This merges the file listing in the directory cache index with the actual working directory list, and shows different combinations of the two.
zh_cn: 这将目录缓存索引中的文件列表与实际工作目录列表合并，并显示了两者的不同组合。

source: This obviously implies the -n because there is nowhere to check out the working tree.
zh_cn: 这显然意味着 -n ，因为没有办法检出工作树。

source: This option affects options that expect path name like --git-dir and --work-tree in that their interpretations of the path names would be made relative to the working directory caused by the -C option.
zh_cn: 该选项影响期望路径名称的选项，像 --git-dir 和 --work-tree，因为他们对路径名称的解释将相对于由 -C 选项指定的工作目录。

source: This option bypasses the pre-commit and commit-msg hooks.
zh_cn: 此选项绕过预提交和提交 msg 钩子。

source: This option bypasses the safety, and is primarily for use by foreign SCM interface scripts.
zh_cn: 此选项绕过安全性，主要由外部 SCM 接口脚本使用。

source: This option can also be used when cloning locally from a repository that already borrows objects from another repository—​the new repository will borrow objects from the same repository, and this option can be used to stop the borrowing.
zh_cn: 当从已经从另一个存储库借用对象的存储库本地克隆时，也可以使用此选项 - 新存储库将从同一存储库中借用对象，并且此选项可用于停止借用。

source: This option can be specified multiple times.
zh_cn: 此选项可以多次指定。

source: This option can be used to override --no-commit.
zh_cn: 此选项可用于覆盖--no-commit。

source: This option can be used to separate command-line options from the list of files, (useful when filenames might be mistaken for command-line options).
zh_cn: 该选项可用于从文件列表中分离命令行选项(当文件名可能被误认为是命令行选项时很有用)。

source: This option can only be used together with --dry-run.
zh_cn: 此选项只能与 --dry-run 一起使用。

source: This option determines how the supplied commit message should be cleaned up before committing.
zh_cn: 此选项确定在提交之前如何清理提供的提交消息。

source: This option has no effect when setting the value (but you can use git config bla ~/ from the command line to let your shell do the expansion).
zh_cn: 此选项在设置值时无效(但您可以使用命令行中的 git config bla ~/ 来让您的 shell 进行扩展)。

source: This option is a no-op when no <pathspec> is used.
zh_cn: 当不使用 <pathspec> 时，此选项是无操作的。

source: This option is implicitly supplied if any other list-like option such as --contains is provided.
zh_cn: 如果提供了任何其他类似列表的选项（如 --contains ），则会隐式提供此选项。

source: This option is primarily to help users who are used to older versions of Git, whose "git add <pathspec>…​" was a synonym for "git add --no-all <pathspec>…​", i.e. ignored removed files.
zh_cn: 此选项主要用于帮助用户使用旧版 Git，其“git add <pathspec> ...”是“git add --no-all <pathspec> ...”的同义词，即忽略删除的文件。

source: This option lets you further edit the message taken from these sources.
zh_cn: 此选项可让您进一步编辑从这些来源获取的消息。

source: This option may be used to override a value set in the help.format configuration variable.
zh_cn: 此选项可用于覆盖 help.format 配置变量中设置的值。

source: This option overrides any given command or guide name.
zh_cn: 此选项将覆盖任何给定的命令或指南名称。

source: This option overrides setting the GIT_CURL_VERBOSE environment variable.
zh_cn: 此选项将覆盖设置 GIT_CURL_VERBOSE 环境变量。

source: This option suppresses that output.
zh_cn: 此选项禁止该输出。

source: This option will suppress the warning (e.g., if you are manually performing operations on submodules).
zh_cn: 此选项将抑制警告(例如，如果您手动对子模块执行操作)。

source: This overrides the pager.<cmd> configuration options (see the "Configuration Mechanism" section below).
zh_cn: 这将覆盖 pager.<cmd> 配置选项(请参阅下面的"配置机制"部分)。

source: This page can be displayed with git help help or git help --help
zh_cn: 可以使用 git help help 或 git help --help 显示此页面。

source: This parameter can be either a URL (see the section GIT URLS below) or the name of a remote (see the section REMOTES below).
zh_cn: 此参数可以是 URL(请参见下面的 GIT URLS 部分)或远程名称(请参阅下面的 REMOTES 部分)。

source: This program is usually not what the end user wants to run directly.
zh_cn: 这个程序通常不是最终用户想要直接运行的。

source: This removes as well as modifies index entries to match the working tree, but adds no new files.
zh_cn: 这将删除以及修改索引条目以匹配工作树，但不会添加新文件。

source: This replaces all lines matching the key (and optionally the value_regex).
zh_cn: 这将替换匹配键(和可选的 value_regex)的所有行。

source: This requires your working tree to be clean (no modifications from the HEAD commit).
zh_cn: 这要求您的工作树清洁(与 HEAD 提交没有修改)。

source: This section can also be used by those who respond to git request-pull or pull-request on GitHub (www.github.com) to integrate the work of others into their history.
zh_cn: 这个部分也可以由那些在 GitHub(www.github.com)上回应 git request-pull 或 pull-request 的用户将其他人的工作整合到他们的历史中。

source: This should be a colon-separated list of absolute paths.
zh_cn: 这应该是一个冒号分隔的绝对路径列表。

source: This should not be confused with git branch -l <branchname>, which creates a branch named <branchname> with a reflog.
zh_cn: 这不应该与 git branch -l <branchname> 混淆，后者创建一个名为 <branchname> 的分支与 reflog。

source: This shows the change between HEAD and index (i.e. what will be committed if you say git commit), and between index and working tree files (i.e. what you could stage further before git commit using git add) for each path.
zh_cn: 这显示了 HEAD 和索引之间的变化(即，如果你说的是 git commit )以及索引和工作树文件之间的转换(也就是你可以在 git commit 使用 git add )。

source: This shows the files and directories to be deleted and issues an "Input ignore patterns>>" prompt.
zh_cn: 这将显示要删除的文件和目录，并发出 "Input ignore patterns>>" 提示。

source: This shows the files and directories to be deleted and issues an "Select items to delete>>" prompt.
zh_cn: 这将显示要删除的文件和目录，并发出 "Select items to delete>>" 提示。

source: This shows the status information and issues an "Update>>" prompt.
zh_cn: 这将显示状态信息并发出"更新>>"提示。

source: This step and the next one could be combined into a single step with "checkout -b my2.6.14 v2.6.14".
zh_cn: 此步骤和下一步可以组合成一个单一的步骤与"checkout -b my2.6.14 v2.6.14"。

source: This subcommand is also typically not used directly by end users.
zh_cn: 此子命令通常也不直接由最终用户使用。

source: This takes precedence over any "-U" or "--unified" option value passed on the Git diff command line.
zh_cn: 这优先于 Git diff 命令行上传递的任何“-U”或“--unified”选项值。

source: This tutorial explains how to import a new project into Git, make changes to it, and share changes with other developers.
zh_cn: 本教程将介绍如何将新项目导入 Git，对其进行更改，并与其他开发人员共享更改。

source: This updates (or creates, as necessary) branches pu and tmp in the local repository by fetching from the branches (respectively) pu and maint from the remote repository.
zh_cn: 更新（或者创建，如果需要的话）本地仓库中的 pu 和 tmp 分支，通地（分别地）抓取远程仓库的 pu 和 maint 分支。

source: This variable has lower precedence than other path variables such as GIT_INDEX_FILE, GIT_OBJECT_DIRECTORY…​
zh_cn: 该变量的优先级低于其他路径变量，例如 GIT_INDEX_FILE，GIT_OBJECT_DIRECTORY ...

source: This variable overrides the config setting ssh.variant that serves the same purpose.
zh_cn: 该变量覆盖用于相同目的的配置设置 ssh.variant 。

source: This variable specifies a ":" separated (on Windows ";" separated) list of Git object directories which can be used to search for Git objects.
zh_cn: 此变量指定可以用于搜索 Git 对象的 Git 对象目录列表，用的“:”分隔(在 Windows 用 “;”分隔)。

source: This will start to clean, and you must confirm one by one in order to delete items.
zh_cn: 这将开始清理，您必须逐个确认才能删除项目。

source: Those filters can modify each tree (e.g. removing a file or running a perl rewrite on all files) or information about each commit.
zh_cn: 这些过滤器可以修改每个树(例如，删除文件或对所有文件执行 perl 重写)或关于每个提交的信息。

source: Though not required, it’s a good idea to begin the commit message with a single short (less than 50 character) line summarizing the change, followed by a blank line and then a more thorough description.
zh_cn: 虽然不是必需的，但是最好用一个简短(小于50个字符)的行来总结更改，然后是空行，然后是更彻底的描述开始提交消息。

source: Thus after making any changes to the working tree, and before running the commit command, you must use the add command to add any new or modified files to the index.
zh_cn: 因此，在对工作树进行任何更改后，在运行 commit 命令之前，必须使用 add 命令将任何新的或修改的文件添加到索引。

source: Thus you may instead want to use rm -f filename as the script.
zh_cn: 因此，您可能希望使用 rm -f filename 作为脚本。

source: Thus, given two directories d and d2, there is a difference between using git rm 'd*' and git rm 'd/*', as the former will also remove all of directory d2.
zh_cn: 因此，给定两个目录 d 和 d2 ，使用 git rm 'd*' 和 git rm 'd/*' 有区别，因为前者也会移除 d2 的所有目录。

source: Time and date specified by the ISO 8601 standard, for example 2005-04-07T22:13:13.
zh_cn: ISO 8601标准指定的时间和日期，例如 2005-04-07T22:13:13 。

source: To merge more than two branches.
zh_cn: merge 两个以上的 branches 。

source: To check out the original <branch> and remove the .git/rebase-apply working files, use the command git rebase --abort instead.
zh_cn: 要检出原始的 <branch> 并移除 .git/rebase-apply 工作文件，请改用命令 git rebase --abort 。

source: To display the git[1] man page, use git help git.
zh_cn: 要显示 git[1] 手册页，请使用 git help git 。

source: To force a push to only one branch, use a + in front of the refspec to push (e.g git push origin +master to force a push to the master branch).
zh_cn: 要强制推送仅一个分支，请在 refspec 前面使用一个 + (例如 git push origin +master 强制推送到 master 分支)。

source: To prepare for working on <branch>, switch to it by updating the index and the files in the working tree, and by pointing HEAD at the branch.
zh_cn: 要准备在<branch>上工作，通过更新索引和工作树中的文件，并将 HEAD 指向分支，来切换到它。

source: To remove selection, prefix the input with - like this:
zh_cn: 要移除选项，输入请使用前缀 - 像这样：

source: To stop tracking a file that is currently tracked, use git rm --cached.
zh_cn: 要停止跟踪一个当前已跟踪的文件，请使用 git rm --cached 。

source: To support this more general usage, the terms "old" and "new" can be used in place of "good" and "bad", or you can choose your own terms.
zh_cn: 为了支持这种更普遍的用法，术语“old”和“new”可以用来代替“good”和“bad”，或者你可以选择自己的术语。

source: Topic branches
zh_cn: 主题分支

source: Topics ▾
zh_cn: 主题 ▾

source: Tracing is turned off at a packet starting with "PACK" (but see GIT_TRACE_PACKFILE below).
zh_cn: 在以"PACK"开头的数据包(但请参阅下面的 GIT_TRACE_PACKFILE )的数据包中关闭跟踪。

source: Trailing spaces are ignored unless they are quoted with backslash ("\").
zh_cn: 尾随空格被忽略，除非它们用反斜杠("\")引用。

source: Treat pathspecs literally (i.e. no globbing, no pathspec magic).
zh_cn: 以字面方式处理路径(即没有通配符，没有路径规则魔术)。

source: Treat the repository as a bare repository.
zh_cn: 将仓库视为裸仓库。

source: Tree Object
zh_cn: 树对象

source: Tree to checkout from (when paths are given).
zh_cn: 检出的树(当路径给出)。

source: Two consecutive asterisks ("**") in patterns matched against full pathname may have special meaning:
zh_cn: 与完整路径名匹配的模式中的两个连续星号("**")可能具有特殊含义：

source: Typically this matches the real type of <object> but asking for a type that can trivially be dereferenced from the given <object> is also permitted.
zh_cn: 通常，这匹配 <object> 的实际类型，但是也允许从给定的 <object> 中简单地解除引用的类型。

source: Typically you would first remove all tracked files from the working tree using this command:
zh_cn: 通常，您将首先使用以下命令从工作树中移除所有跟踪的文件：

source: Typically you would want comparison with the latest commit, so if you do not give <commit>, it defaults to HEAD.
zh_cn: 通常，您需要与最新的提交进行比较，所以如果不给出<commit>，则默认为 HEAD。

source: Understanding History: Commits
zh_cn: 了解历史：提交

source: Understanding history: History diagrams
zh_cn: 了解历史：历史图

source: Understanding history: What is a branch?
zh_cn: 了解历史：什么是分支？

source: Understanding history: commits, parents, and reachability
zh_cn: 了解历史：提交，父提交和可达性

source: Undo a commit and redo
zh_cn: 撤消提交并重做

source: Undo a commit, making it a topic branch
zh_cn: 撤销提交，使其成为 topic 分支

source: Undo a merge or pull
zh_cn: 撤消合并或拉

source: Undo a merge or pull inside a dirty working tree
zh_cn: 撤消合并或拉在脏的工作树

source: Undo add
zh_cn: 撤消添加

source: Undo commits permanently
zh_cn: 永久撤消提交

source: Undoing a merge
zh_cn: 撤消合并

source: Unless -f is given, the named tag must not yet exist.
zh_cn: 除非给出 -f ，否则命名标签不能存在。

source: Unless -m <msg> or -F <file> is given, an editor is started for the user to type in the tag message.
zh_cn: 除非给出了 -m <msg> 或 -F <file> ，否则将启动一个编辑器，供用户键入标签消息。

source: Unlike pop, <stash> may be any commit that looks like a commit created by stash save or stash create.
zh_cn: 与 pop 不同， <stash> 可能是任何看起来像由 stash save 或 stash create 创建的提交。

source: Unlike other trace output, this trace is verbatim: no headers, and no quoting of binary data.
zh_cn: 与其他跟踪输出不同，该跟踪是逐字的：没有标题，也没有引用二进制数据。

source: Unpack objects from a packed archive
zh_cn: 从打包的归档文件中解包对象

source: Unsetting the variable, or setting it to empty, "0" or "false" (case insensitive) disables trace messages.
zh_cn: 取消设置变量或将其设置为空，“0”或“false”(不区分大小写)将禁用跟踪消息。

source: Update auxiliary info file to help dumb servers
zh_cn: 更新辅助信息文件以帮助哑服务器

source: Update remote refs along with associated objects
zh_cn: 更新远程引用以及关联的对象

source: Update the index by adding new files that are unknown to the index and files modified in the working tree, but ignore files that have been removed from the working tree.
zh_cn: 通过添加索引未知的新文件和在工作树中修改的文件来更新索引，但忽略已从工作树中删除的文件。

source: Update the index just where it already has an entry matching <pathspec>.
zh_cn: 更新索引，只要它已经有一个条目匹配 <pathspec>。

source: Update the index not only where the working tree has a file matching <pathspec> but also where the index already has an entry.
zh_cn: 更新索引不仅工作树具有与 <pathspec> 匹配的文件，而且索引已经具有条目的位置。

source: Update the object name stored in a ref safely
zh_cn: 安全地更新存储在 ref 中的对象名

source: Update the origin repository’s master branch with the dev branch, allowing non-fast-forward updates.
zh_cn: 使用 dev 分支更新 origin 存储库的 master 分支，允许非快速更新。

source: Update the remote-tracking branches for the repository you cloned from, then merge one of them into your current branch:
zh_cn: 更新从您克隆的仓库的远程跟踪分支，然后将其中的一个分支合并到当前分支中：

source: Update the remote-tracking branches:
zh_cn: 更新远程跟踪分支：

source: Updates files in the working tree to match the version in the index or the specified tree.
zh_cn: 更新工作树中的文件以匹配索引或指定树中的版本。

source: Updates remote refs using local refs, while sending objects necessary to complete the given refs.
zh_cn: 使用本地引用更新远程引用，同时发送完成给定引用所需的对象。

source: Updating a repository with git fetch
zh_cn: 使用 git fetch 更新仓库

source: Upon completion, <branch> will be the current branch.
zh_cn: 完成后，<branch> 将成为当前分支。

source: Upstream branch to compare against.
zh_cn: 相比较的上游分支。

source: Use -f option twice if you really want to remove such a directory.
zh_cn: 如果您真的要移除这样的目录，请使用 -f 选项两次。

source: Use git-am[1] to create commits from patches generated by git-format-patch[1] and/or received by email.
zh_cn: 使用 git-am[1] 创建由 git-format-patch[1] 生成的补丁和/或通过电子邮件接收的修补程序。

source: Use -r together with -d to delete remote-tracking branches.
zh_cn: 将 -r 与 -d 一起使用来删除远程跟踪分支。

source: Use git mergetool to run one of several merge utilities to resolve merge conflicts.
zh_cn: 使用 git mergetool 运行多个合并实用程序之一来解决合并冲突。

source: Use git stash when you want to record the current state of the working directory and the index, but want to go back to a clean working directory.
zh_cn: 当要记录工作目录和索引的当前状态，但是要返回到干净的工作目录时，请使用 git stash 。

source: Use - to read the message from the standard input.
zh_cn: 使用 - 从标准输入读取消息。

source: Use a tarball as a starting point for a new repository.
zh_cn: 使用 tarball 作为新存储库的起点。

source: Use binary search to find the commit that introduced a bug
zh_cn: 使用二分法来查找引入错误的提交

source: Use newline instead as a delimiter between key and value.
zh_cn: 使用换行符作为键和值之间的分隔符。

source: Use the given <msg> as the commit message.
zh_cn: 使用给定的 <msg> 作为提交消息。

source: Use the given config file instead of the one specified by GIT_CONFIG.
zh_cn: 使用给定的配置文件，而不是 GIT_CONFIG 指定的配置文件。
